In [1]:
import numpy as np 
import pandas as pd
import pandas_profiling

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_12532\58495532.py:3: DeprecationWarning: `import pandas_profiling` is going to be deprecated by April 1st. Please use `import ydata_profiling` instead.
  import pandas_profiling

# Importing Datset 1

In [2]:
df1 = pd.read_csv('104.csv')

In [3]:
df1 = df1.drop(df1.columns[2:14], axis=1)

In [4]:
df1.head()

,Category,Segment,2013-14,2014-15
0,Passenger Vehicles (PVs),Passenger Cars,2519281.0,2590917.0
1,Passenger Vehicles (PVs),Multi-Utility Vehicles,568692.0,629255.0
2,Passenger Vehicles (PVs),Total Passenger Vehicles (PVs),3087973.0,3220172.0
3,Commercial Vehicles - M & HCVs,Passenger Carriers,41175.0,49360.0
4,Commercial Vehicles - M & HCVs,Goods Carriers,180381.0,219193.0

In [5]:
# checking the shape (# of rows and columns) of the datasets
print('DF1 Shape: ', df1.shape)

DF1 Shape:  (19, 4)

In [6]:
# Generate a report using pandas profiling
profile = pandas_profiling.ProfileReport(df1)

# Save the report to an HTML file
profile.to_file('104.html')

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

In [7]:
df1.to_csv('104_modified.csv', index=False)

In [8]:
df1.head()

,Category,Segment,2013-14,2014-15
0,Passenger Vehicles (PVs),Passenger Cars,2519281.0,2590917.0
1,Passenger Vehicles (PVs),Multi-Utility Vehicles,568692.0,629255.0
2,Passenger Vehicles (PVs),Total Passenger Vehicles (PVs),3087973.0,3220172.0
3,Commercial Vehicles - M & HCVs,Passenger Carriers,41175.0,49360.0
4,Commercial Vehicles - M & HCVs,Goods Carriers,180381.0,219193.0

# Importing Dataset 2

In [9]:
df2 = pd.read_csv('112.csv')

In [10]:
df2.shape

(30, 10)

In [11]:
df2.head()

,Sl. No,State,Two Wheelers (Category L1 & L2 as per Central Motor Vehicles Rules,Two Wheelers (Category L2 (CMVR)),Two Wheelers (Max power not exceeding 250 Watts),Three Wheelers (Category L5 slow speed as per CMVR),Three Wheelers (Category L5 as per CMVR),Passenger Cars (Category M1 as per CMVR),Buses,Total in state
0,1,Meghalaya,0,0,0,0,0,6,0,6
1,2,Nagaland,0,20,3,0,0,1,0,24
2,3,Manipur,16,8,11,0,5,12,0,52
3,4,Tripura,28,9,36,0,0,8,0,81
4,5,Andaman & Nicobar islands,0,0,0,0,0,82,0,82

In [12]:
df2['Two Wheelers (Category L1 & L2 as per Central Motor Vehicles Rules'] = df2['Two Wheelers (Category L1 & L2 as per Central Motor Vehicles Rules'] + df2['Two Wheelers (Category L2 (CMVR))'] + df2['Two Wheelers (Max power not exceeding 250 Watts)']

In [13]:
df2['Three Wheelers (Category L5 slow speed as per CMVR)'] = df2['Three Wheelers (Category L5 slow speed as per CMVR)'] + df2['Three Wheelers (Category L5 as per CMVR)']

In [14]:
df2.head()

,Sl. No,State,Two Wheelers (Category L1 & L2 as per Central Motor Vehicles Rules,Two Wheelers (Category L2 (CMVR)),Two Wheelers (Max power not exceeding 250 Watts),Three Wheelers (Category L5 slow speed as per CMVR),Three Wheelers (Category L5 as per CMVR),Passenger Cars (Category M1 as per CMVR),Buses,Total in state
0,1,Meghalaya,0,0,0,0,0,6,0,6
1,2,Nagaland,23,20,3,0,0,1,0,24
2,3,Manipur,35,8,11,5,5,12,0,52
3,4,Tripura,73,9,36,0,0,8,0,81
4,5,Andaman & Nicobar islands,0,0,0,0,0,82,0,82

In [15]:
df2.drop(columns = ['Two Wheelers (Category L2 (CMVR))', 'Two Wheelers (Max power not exceeding 250 Watts)', 'Three Wheelers (Category L5 as per CMVR)'], inplace = True)

In [16]:
df2.head()

,Sl. No,State,Two Wheelers (Category L1 & L2 as per Central Motor Vehicles Rules,Three Wheelers (Category L5 slow speed as per CMVR),Passenger Cars (Category M1 as per CMVR),Buses,Total in state
0,1,Meghalaya,0,0,6,0,6
1,2,Nagaland,23,0,1,0,24
2,3,Manipur,35,5,12,0,52
3,4,Tripura,73,0,8,0,81
4,5,Andaman & Nicobar islands,0,0,82,0,82

In [17]:
df2.rename(columns={'Two Wheelers (Category L1 & L2 as per Central Motor Vehicles Rules':'Two Wheelers', 'Three Wheelers (Category L5 slow speed as per CMVR)':'Three Wheelers' , 'Passenger Cars (Category M1 as per CMVR)':'Passenger Cars'}, inplace=True)

In [18]:
df2.head()

,Sl. No,State,Two Wheelers,Three Wheelers,Passenger Cars,Buses,Total in state
0,1,Meghalaya,0,0,6,0,6
1,2,Nagaland,23,0,1,0,24
2,3,Manipur,35,5,12,0,52
3,4,Tripura,73,0,8,0,81
4,5,Andaman & Nicobar islands,0,0,82,0,82

In [19]:
df2.head()

,Sl. No,State,Two Wheelers,Three Wheelers,Passenger Cars,Buses,Total in state
0,1,Meghalaya,0,0,6,0,6
1,2,Nagaland,23,0,1,0,24
2,3,Manipur,35,5,12,0,52
3,4,Tripura,73,0,8,0,81
4,5,Andaman & Nicobar islands,0,0,82,0,82

In [20]:
# Generate a report using pandas profiling
profile = pandas_profiling.ProfileReport(df2)

# Save the report to an HTML file
profile.to_file('112.html')

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

In [21]:
# checking the shape (# of rows and columns) of the datasets
print('DF2 Shape: ', df2.shape)

DF2 Shape:  (30, 7)

# Importing Dataset 3

In [22]:
df3 = pd.read_csv('102_103_105_107.csv')
df3 = df3.rename(columns={'State Name': 'State'})

In [23]:
df3.head()

,State,No. of EV Chargers Sanctioned,No of RO's where EV Charging Facility available,Total Electric Vehicle,Total Non-Electric Vehicle,Total EV supported by state for adoption and manufacturing
0,Andhra Pradesh,266.0,65.0,NaN,NaN,6393.0
1,Arunachal Pradesh,NaN,4.0,20,"2,52,965",1.0
2,Assam,20.0,19.0,64766,"46,77,053",827.0
3,Bihar,37.0,26.0,83335,"1,04,07,078",5255.0
4,Chandigarh,70.0,4.0,2812,"7,46,881",154.0

In [24]:
merged_df = pd.merge(df2 , df3 , on='State')

In [25]:
merged_df.to_csv('102_103_105_107_112.csv', index=False)

In [26]:
df = pd.read_csv('102_103_105_107_112.csv')

In [27]:
df.head()

,Sl. No,State,Two Wheelers,Three Wheelers,Passenger Cars,Buses,Total in state,No. of EV Chargers Sanctioned,No of RO's where EV Charging Facility available,Total Electric Vehicle,Total Non-Electric Vehicle,Total EV supported by state for adoption and manufacturing
0,1,Meghalaya,0,0,6,0,6,40.0,3.0,49,"4,59,001",10.0
1,2,Nagaland,23,0,1,0,24,NaN,2.0,58,"3,39,129",NaN
2,3,Manipur,35,5,12,0,52,NaN,1.0,586,"4,99,324",140.0
3,4,Tripura,73,0,8,0,81,NaN,3.0,9262,"6,50,026",750.0
4,6,Himachal Pradesh,0,0,98,0,98,10.0,13.0,1175,"19,64,754",446.0